// Задача 8: показать  чётные числа от 1 до N.
Console.WriteLine("Введите число N");
int N = Convert.ToInt32(Console.ReadLine());

for (int i = 2 ; 1<=N; i+=2 ) 
Console.Write(i + " ");
